from superduper_pipeline import run as superduper_run
from legacy_pipeline import run as legacy_run
from normalizer_pipeline import run as normalizer_run

test1 = (
    [
        'من تر۲۲۲شی دوست دارم.'
        # [3,9]
        , 'من ترش23432ی دوست دارم'
        # [3,11]
        , 'من ت٫ریال^٪ریال&آٖۤآلبدذ رشی دوست دارم'
        # ok
        , 'من ت#$@رشی          دوست دارم'
        # [3,19]
        , 'من       ت                      ر                ش                      ی           دوست دارم'
        # [3,83]
        , 'من تررررررررررررررررررشششششی دوست دارم'
        # [3,27]
        , 'من ترش و شیرین دوست دارم'
        # ok
        , 'من ترشک دوست دارم'
        # ok
        , 'من#ترشی٫دوست@دارم'
    ],
    [
        'ترشی'
    ]
)

test2 = (
    [
        'مراقب باش که سرماد نخوری'
        # ok
        , 'سرمان به باد رفت'
        # ok
        , 'سر‌‌‌‌ما بد است!'  # multiple nim faseles!!
        # [0, 9]
        , 'سررررررررررمامان داد نزن'
        # ok
        , 'من در سررم٫ااا میخواهم که تررر٪ش۰ی سییییـــــــر بخورم '
        # [  [35,48] , [26,34] , [6,14] ]
        , 'ثرم۱ زده شدم! سرم از بس ۳رما خورده درد گرفته'
    ],
    [
        'سرما'
    ]
)

test3 = (
    [
        'میخواهم برم به س‌ی‌ر‌ج‌ا‌ن.'
        # [15,20]
        , 'بیا سیرجان بریم یه سSSیSerرجاfن'
        # [12,22]
        , 'از رفتن به سیرجان سیرشده ام! سیر جان شدم دیگه!'
        , 'سیرابیجان کلمه‌ی زشتیه!'
    ],
    [
        'سیرجان'
    ]
)

test4 = (
    [
        'من تف‌نگ میخوام.'
        # [3,6]
        , 'من توفنگ دوست دارم'
        # [3,7]
        , 'من منتلیمخنخر خحهنخشهتهتاییلا دوست دارم'
        # ok
        , 'تفنگی دارم خوشگله ترشششش یکمی هست بهبه'
        # [0,5]
        , 'تنفگ فروشی اصغر آقا'
        , 'تفنگ رو برعکس کنی میشه گنفت! عمرا اگه این سیستم هوشمندشون تشخیصش بده!'
    ], [
        'تفنگ',
        'ترش',
    ]
)

test5 = (
    [
        'اسقر برای من یک تفن‌ک بخر',
        'کلاهم پس معرکه‌اس',
        'شلغم پلو با گردنبند',
    ], [
        'تفنگ',
        'کلاه',
        'اصغر',
        'معرکه',
        'شلغمپلو',
        'گردن',
    ]
)

test6 = (
    [
        'میخاهیم با قلط های تایپی ۳یسطم را گول بزنیم! امیدوارم خرشید تلوع کنه!',
        'غستننتنیه ش‌ح‌ر خیلی بدیه',
        'قیر غابل غبول است هرفت!'
    ],
    [
        'غلط',
        'قسطنطنیه',
        'غیرقابلقبول',
        'حرف',
        'شهر',
        'خورشید',
        'میخواهیم',
        'سیستم',
        'طلوع',
    ]
)

test7 = (
    [
        'نخهعغف خعهغیقس گهکعغعفقفیقس عغفقثتسثست قیفبلتا تمهعغفقبیذدزتنخک ۷قبفلغاتهنخ۰ح۹۸ک۷فمق۶نغ هحغفیقط#❊❊❊۰897689بلذادا تعحعغ۸ف۷ق۶غ۵ثفسبلا ۰۹۸۷۶۵ثف فغ9ghbgfxzsd0ففغیقذلادز سگ اتنتتزاز ۷فغل ات خحمن',

    ], [
        'سگ',
        'سلام',
    ]
)

test8 = (
    [
        "فنگت سلام تگنف سلام نتگف سلام تفنگ خدافظ گنفت"
    ],
    [
        'تفنگ'
    ]
)


test9 = (
    [
'پایطون یک نرم ۱فظار سطح جهانی است باید سازنده اش را دعا کرد. نشست با دانشمندات یک درصد بدتر سطح جهان جالب بود چون گفتند که نوتیاپ کارهای مختلفی انجام میده و پایتن شون چه خوبه اوف، حتی با پایطون شون میتونیم به ناصا بریم!!! حالا سوال اصلی اینه که  آیا به ❊پایتون# نهار دادن؟؟؟',
    ], [
        'پایتون',
        'برتر',
        'افطار',
        'نرم افزار',
    ]
)


test10 = (
    [
        'شیلام من شیلا ام نیشتم.',
        'شیتنی نکن کره خر',
        'تو ای ساغر هستی به کامم ننشستی ندانم میگه چه بودی ندانم که چه هستی',
        'فاااٌُّغد اهمیت',

    ], [
        'سلام',
        'فاقد',
        'شیطونی',
        'هشت',
    ]
)


def run_tests(pipeline: callable):
    tests = [eval(f'test{i}') for i in range(1, 11)]
    for test_index, (test_texts, illegals) in enumerate(tests):
        print("\n----------------------------------Test set #", test_index + 1, "----------------------------------")
        for test_text in test_texts:
            print('\n**', test_text, '**')
            out = pipeline(test_text, illegals)
            for item in out:
                print(repr(item), ':', out[item])


if __name__ == '__main__':
    run_tests(superduper_run)
    # run_tests(legacy_run)
    # run_tests(normalizer_run)
