from superduper_pipeline import run as superduper_run
from legacy_pipeline import run as legacy_run
from normalizer_pipeline import run as normalizer_run

test1 = (
    [
        'من تر۲۲۲شی دوست دارم.'
        # [3,9]
        , 'من ترش23432ی دوست دارم'
        # [3,11]
        , 'من ت٫ریال^٪ریال&آٖۤآلبدذ رشی دوست دارم'
        # ok
        , 'من ت#$@رشی          دوست دارم'
        # [3,19]
        , 'من       ت                      ر                ش                      ی           دوست دارم'
        # [3,83]
        , 'من تررررررررررررررررررشششششی دوست دارم'
        # [3,27]
        , 'من ترش و شیرین دوست دارم'
        # ok
        , 'من ترشک دوست دارم'
        # ok
        , 'مراقب باش که سرمانخوری'
        # ok
        , 'سرمان به باد رفت'
        # ok
        , 'سر‌‌‌‌ما بد است!'  # multiple nim faseles!!
        # [0, 9]
        , 'سررررررررررمامان داد نزن'
        # ok
        , 'سرمامانداد نزن'
        # ok
        , 'من در سررم٫ااا میخواهم که تررر٪ش۰ی سییییـــــــر بخورم '
        # [  [35,48] , [26,34] , [6,14] ]
        , 'من#ترشی٫دوست@دارم'
        , 'میخواهم برم به س‌ی‌ر‌ج‌ا‌ن.'
        # [15,20]
        , 'بیا سیرجان بریم یه سSSیSerرجاfن'
        # [12,22]
        , 'من تف‌نگ میخوام.'
        # [3,6]
        , 'من تفنگ دوست دارم'
        # [3,7]
        , 'من منتلیمخنخر خحهنخشهتهتاییلا دوست دارم'
        # ok
        , 'من منتلیمخنخرخحهنخشهتهتاییلا دوست دارم'
        # [4,29]
        , 'تفنگی دارم خوشگله ترش یکمی هست بهبه'
        # [0,5]
        , 'غستننتنیه شهر خیلی بدیه'
        , 'قیر غابل غبول است هرفت!'
        , 'سرم۱ زده شدم لامسپ'
    ], [
        'تفنگ',
        'سیرجان',
        'بی ادب',
        'بی‌تربیت',
        'چنگال',
        'سرما',
        'ترشی',
        'ممد',
        'غیرقابلقبول',
        'قسطنتنیه',
        'لامصب',
    ]
)

test2 = (
    [
        'اسقر برای من یک تفن‌ک بخر',
        'کلاهم پس معرکه‌اس',
        'شلغم پلو با گردنبند',
    ], [
        'تفنگ',
        'کلاه',
        'اصغر',
        'معرکه',
        'شلغم پلو',
        'گردن',
    ]
)


test3 = (
    [
        'نخهعغف خعهغیقس گهکعغعفقفیقس عغفقثتسثست قیفبلتا تمهعغفقبیذدزتنخک ۷قبفلغاتهنخ۰ح۹۸ک۷فمق۶نغ هحغفیقط#❊❊❊۰897689بلذادا تعحعغ۸ف۷ق۶غ۵ثفسبلا ۰۹۸۷۶۵ثف فغ9ghbgfxzsd0ففغیقذلادزاتنتتزاز ۷فغل ات خحمن',

    ], [
        'سگ',
        'سلام',
    ]
)


def run_tests(pipeline: callable):
    tests = [test1, test2]
    for test_index, (test_texts, illegals) in enumerate(tests):
        print("\n----------------------------------Test set #", test_index + 1, "----------------------------------")
        for test_text in test_texts:
            print('\n**', test_text, '**')
            out = pipeline(test_text, illegals)
            for item in out:
                print(repr(item), ':', out[item])


if __name__ == '__main__':
    run_tests(superduper_run)
    # run_tests(legacy_run)
    # run_tests(normalizer_run)
